app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test"], ["email", "user@mail.com"], ["name", "Test User"], ["created_at", "2016-04-16 22:38:53.233622"], ["updated_at", "2016-04-16 22:38:53.233622"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save